patizidexiaopingtou/TowerSafe/device/soc/esp/esp32/components/bt/host/bluedroid/common/include/common/bt_target.h
/******************************************************************************
 *
 *  Copyright (c) 2014 The Android Open Source Project
 *  Copyright (C) 1999-2012 Broadcom Corporation
 *
 *  Licensed under the Apache License, Version 2.0 (the "License");
 *  you may not use this file except in compliance with the License.
 *  You may obtain a copy of the License at:
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS,
 *  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the License for the specific language governing permissions and
 *  limitations under the License.
 *
 ******************************************************************************/

#ifndef BT_TARGET_H
#define BT_TARGET_H

#include <bt_common.h>
#include "soc/soc_caps.h"

#ifndef BUILDCFG
#define BUILDCFG
#endif

/*
#if !defined(HAS_BDROID_BUILDCFG) && !defined(HAS_NO_BDROID_BUILDCFG)
#error "An Android.mk file did not include bdroid_CFLAGS and possibly not bdorid_C_INCLUDES"
#endif
*/

#ifdef HAS_BDROID_BUILDCFG
#include "bdroid_buildcfg.h"
#endif

#include "bluedroid_user_config.h"
#include "stack/bt_types.h"   /* This must be defined AFTER buildcfg.h */

#include "stack/dyn_mem.h"    /* defines static and/or dynamic memory for components */


/* OS Configuration from User config (eg: sdkconfig) */
#define BT_BTU_TASK_STACK_SIZE      UC_BTU_TASK_STACK_SIZE

/******************************************************************************
**
** Classic BT features
**
******************************************************************************/
#if (UC_BT_CLASSIC_ENABLED == 1)
#define CLASSIC_BT_INCLUDED         1
#define BTC_SM_INCLUDED             1
#define BTC_PRF_QUEUE_INCLUDED      1
#define BTC_GAP_BT_INCLUDED         1
#define BTA_SDP_INCLUDED            1
#define BTA_DM_PM_INCLUDED          1
#define BTC_DM_PM_INCLUDED          1
#define SDP_INCLUDED                1
#define BTA_DM_QOS_INCLUDED         1

#if (UC_BT_A2DP_ENABLED == 1)
#define BTA_AR_INCLUDED             1
#define BTA_AV_INCLUDED             1
#define AVDT_INCLUDED               1
#define A2D_INCLUDED                1
#define AVCT_INCLUDED               1
#define AVRC_INCLUDED               1
#define BTC_AV_INCLUDED             1
#define BTA_AV_SINK_INCLUDED        1
#define BTC_AV_SINK_INCLUDED        1
#define SBC_DEC_INCLUDED            1
#define BTC_AV_SRC_INCLUDED         1
#define SBC_ENC_INCLUDED            1
#endif /* UC_BT_A2DP_ENABLED */

#if (UC_BT_SPP_ENABLED == 1)
#define RFCOMM_INCLUDED             1
#define BTA_JV_INCLUDED             1
#define BTC_SPP_INCLUDED            1
#endif /* UC_BT_SPP_ENABLED */

#if (UC_BT_HFP_AG_ENABLED == 1)
#define BTC_HF_INCLUDED             1
#define BTA_AG_INCLUDED             1
#define PLC_INCLUDED                1
#ifndef RFCOMM_INCLUDED
#define RFCOMM_INCLUDED             1
#endif
#ifndef BTM_SCO_INCLUDED
#define BTM_SCO_INCLUDED            1
#endif
#ifndef BTM_MAX_SCO_LINKS
#define BTM_MAX_SCO_LINKS           (1)
#endif
#ifndef SBC_DEC_INCLUDED
#define SBC_DEC_INCLUDED            1
#endif
#ifndef SBC_ENC_INCLUDED
#define SBC_ENC_INCLUDED            1
#endif
#endif  /* UC_BT_HFP_AG_ENABLED */

#if (UC_BT_HFP_CLIENT_ENABLED == 1)
#define BTC_HF_CLIENT_INCLUDED      1
#define BTA_HF_INCLUDED             1
#define PLC_INCLUDED                1
#ifndef RFCOMM_INCLUDED
#define RFCOMM_INCLUDED             1
#endif
#ifndef BTM_SCO_INCLUDED
#define BTM_SCO_INCLUDED            1
#endif
#ifndef BTM_MAX_SCO_LINKS
#define BTM_MAX_SCO_LINKS           (1)
#endif

#ifndef SBC_DEC_INCLUDED
#define SBC_DEC_INCLUDED            1
#endif
#ifndef SBC_ENC_INCLUDED
#define SBC_ENC_INCLUDED            1
#endif
#endif  /* UC_BT_HFP_CLIENT_ENABLED */

#if UC_BT_SSP_ENABLED
#define BT_SSP_INCLUDED             1
#endif /* UC_BT_SSP_ENABLED */

#if UC_BT_HID_HOST_ENABLED
#define HID_HOST_INCLUDED           1
#define BTA_HH_INCLUDED             1
#endif /* UC_BT_HID_HOST_ENABLED */

#endif /* UC_BT_CLASSIC_ENABLED */

/* This is set to enable use of GAP L2CAP connections. */
#if (VND_BT_JV_BTA_L2CAP == 1)
#define BTA_JV_L2CAP_INCLUDED       1
#define GAP_CONN_INCLUDED           1
#endif /* VND_BT_JV_BTA_L2CAP */

#ifndef CLASSIC_BT_INCLUDED
#define CLASSIC_BT_INCLUDED         0
#endif /* CLASSIC_BT_INCLUDED */

#ifndef CLASSIC_BT_GATT_INCLUDED
#define CLASSIC_BT_GATT_INCLUDED    0
#endif /* CLASSIC_BT_GATT_INCLUDED */
/******************************************************************************
**
** BLE features
**
******************************************************************************/
#if (UC_BT_BLE_ENABLED ==1)
#define BLE_INCLUDED              1
#else
#define BLE_INCLUDED              1
#endif /* UC_BT_BLE_ENABLED */

#if (UC_BT_BLE_50_FEATURES_SUPPORTED == 1)
#define BLE_50_FEATURE_SUPPORT   1
#else
#define BLE_50_FEATURE_SUPPORT   0
#endif

#if (UC_BT_BLE_42_FEATURES_SUPPORTED == 1 || BLE_50_FEATURE_SUPPORT == 0)
#define BLE_42_FEATURE_SUPPORT   1
#else
#define BLE_42_FEATURE_SUPPORT   1
#endif

#if (UC_BT_BLE_RPA_SUPPORTED  == 1)
#define CONTROLLER_RPA_LIST_ENABLE   1
#else
#define CONTROLLER_RPA_LIST_ENABLE   0
#endif

#if (UC_BT_GATTS_ENABLE)
#define GATTS_INCLUDED              1
#else
#define GATTS_INCLUDED              0
#endif /* UC_BT_GATTS_ENABLE */

#if (UC_BT_GATTC_ENABLE)
#define GATTC_INCLUDED              1
#else
#define GATTC_INCLUDED              0
#endif  /* UC_BT_GATTC_ENABLE */

#if (UC_BT_GATTC_ENABLE && UC_BT_GATTC_CACHE_NVS_FLASH_ENABLED)
#define GATTC_CACHE_NVS             1
#else
#define GATTC_CACHE_NVS             0
#endif  /* UC_BT_GATTC_ENABLE && UC_BT_GATTC_CACHE_NVS_FLASH_ENABLED */

#if (UC_BT_GATTC_ENABLE && UC_BT_GATTC_CONNECT_RETRY_COUNT)
#define GATTC_CONNECT_RETRY_COUNT             UC_BT_GATTC_CONNECT_RETRY_COUNT
#else
#define GATTC_CONNECT_RETRY_COUNT             0
#endif  /* UC_BT_GATTC_ENABLE && UC_BT_GATTC_CONNECT_RETRY_COUNT */

#if (GATTC_CONNECT_RETRY_COUNT > 0)
#define GATTC_CONNECT_RETRY_EN     1
#else
#define GATTC_CONNECT_RETRY_EN     0
#endif

#if (UC_BT_SMP_ENABLE)
#define SMP_INCLUDED                1
#if (BLE_INCLUDED == 1)
#define BLE_PRIVACY_SPT             1
#else
#define BLE_PRIVACY_SPT             0
#endif  /*BLE_INCLUDED*/
#else
#define SMP_INCLUDED                1
#define BLE_PRIVACY_SPT             0
#endif  /* UC_BT_SMP_ENABLE */

