patizidexiaopingtou/TowerSafe/device/soc/esp/esp32/components/bt/host/bluedroid/common/include/common/bt_target.h
#if(UC_BT_SMP_SLAVE_CON_PARAMS_UPD_ENABLE)
#define SMP_SLAVE_CON_PARAMS_UPD_ENABLE     1
#else
#define SMP_SLAVE_CON_PARAMS_UPD_ENABLE     0
#endif /* UC_BT_SMP_SLAVE_CON_PARAMS_UPD_ENABLE */

#ifdef UC_BTDM_BLE_ADV_REPORT_FLOW_CTRL_SUPP
#define BLE_ADV_REPORT_FLOW_CONTROL         (UC_BTDM_BLE_ADV_REPORT_FLOW_CTRL_SUPP && BLE_INCLUDED)
#endif /* UC_BTDM_BLE_ADV_REPORT_FLOW_CTRL_SUPP */

#ifdef UC_BTDM_BLE_ADV_REPORT_FLOW_CTRL_NUM
#define BLE_ADV_REPORT_FLOW_CONTROL_NUM     UC_BTDM_BLE_ADV_REPORT_FLOW_CTRL_NUM
#endif /* UC_BTDM_BLE_ADV_REPORT_FLOW_CTRL_NUM */

#ifdef UC_BTDM_BLE_ADV_REPORT_DISCARD_THRSHOLD
#define BLE_ADV_REPORT_DISCARD_THRSHOLD     UC_BTDM_BLE_ADV_REPORT_DISCARD_THRSHOLD
#endif /* UC_BTDM_BLE_ADV_REPORT_DISCARD_THRSHOLD */

#ifdef UC_BT_ACL_CONNECTIONS
#define MAX_ACL_CONNECTIONS         UC_BT_ACL_CONNECTIONS
#define GATT_MAX_PHY_CHANNEL        UC_BT_ACL_CONNECTIONS
#endif  /* UC_BT_ACL_CONNECTIONS */

#ifdef UC_BT_MULTI_CONNECTION_ENBALE
#define BT_MULTI_CONNECTION_ENBALE  UC_BT_MULTI_CONNECTION_ENBALE
#endif

#if(BT_MULTI_CONNECTION_ENBALE && (CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32S3))
#define BLE_CE_LEN_MIN           5
#else
#define BLE_CE_LEN_MIN           0
#endif

#ifdef UC_BT_BLE_ESTAB_LINK_CONN_TOUT
#define BLE_ESTABLISH_LINK_CONNECTION_TIMEOUT UC_BT_BLE_ESTAB_LINK_CONN_TOUT
#endif

#ifdef SOC_BLE_DONT_UPDATE_OWN_RPA
#define BLE_UPDATE_BLE_ADDR_TYPE_RPA 0
#else
#define BLE_UPDATE_BLE_ADDR_TYPE_RPA 1
#endif
//------------------Added from bdroid_buildcfg.h---------------------
#ifndef L2CAP_EXTFEA_SUPPORTED_MASK
#define L2CAP_EXTFEA_SUPPORTED_MASK (L2CAP_EXTFEA_ENH_RETRANS | L2CAP_EXTFEA_STREAM_MODE | L2CAP_EXTFEA_NO_CRC | L2CAP_EXTFEA_FIXED_CHNLS)
#endif

#ifndef BTUI_OPS_FORMATS
#define BTUI_OPS_FORMATS (BTA_OP_VCARD21_MASK | BTA_OP_ANY_MASK)
#endif

#ifndef BTA_RFC_MTU_SIZE
#define BTA_RFC_MTU_SIZE (L2CAP_MTU_SIZE-L2CAP_MIN_OFFSET-RFCOMM_DATA_OVERHEAD)
#endif

#ifndef SBC_NO_PCM_CPY_OPTION
#define SBC_NO_PCM_CPY_OPTION 0
#endif

#ifndef BT_APP_DEMO
#define BT_APP_DEMO 1
#endif

#ifndef BTIF_INCLUDED
#define BTIF_INCLUDED 0
#endif

/******************************************************************************
**
** BTC-layer components
**
******************************************************************************/
#ifndef BTC_GAP_BT_INCLUDED
#define BTC_GAP_BT_INCLUDED 0
#endif

#ifndef BTC_PRF_QUEUE_INCLUDED
#define BTC_PRF_QUEUE_INCLUDED 0
#endif

#ifndef BTC_SM_INCLUDED
#define BTC_SM_INCLUDED 0
#endif

#ifndef BTC_AV_INCLUDED
#define BTC_AV_INCLUDED 0
#endif

#ifndef BTC_AV_SINK_INCLUDED
#define BTC_AV_SINK_INCLUDED 0
#endif

#ifndef BTC_AV_SRC_INCLUDED
#define BTC_AV_SRC_INCLUDED 0
#endif

#ifndef BTC_SPP_INCLUDED
#define BTC_SPP_INCLUDED 0
#endif

#ifndef SBC_DEC_INCLUDED
#define SBC_DEC_INCLUDED 0
#endif

#ifndef SBC_ENC_INCLUDED
#define SBC_ENC_INCLUDED 0
#endif

/******************************************************************************
**
** BTA-layer components
**
******************************************************************************/
#ifndef BTA_INCLUDED
#define BTA_INCLUDED 1
#endif

#ifndef BTA_DM_PM_INCLUDED
#define BTA_DM_PM_INCLUDED 0
#endif

#ifndef BTA_DM_QOS_INCLUDED
#define BTA_DM_QOS_INCLUDED 0
#endif

#ifndef BTA_PAN_INCLUDED
#define BTA_PAN_INCLUDED 0
#endif

#ifndef BTA_HH_INCLUDED
#define BTA_HH_INCLUDED 0
#endif

#ifndef BTA_HH_ROLE
#define BTA_HH_ROLE BTA_MASTER_ROLE_PREF
#endif

#ifndef BTA_HH_LE_INCLUDED
#define BTA_HH_LE_INCLUDED 0
#endif

#ifndef BTA_AR_INCLUDED
#define BTA_AR_INCLUDED 0
#endif

#ifndef BTA_AV_INCLUDED
#define BTA_AV_INCLUDED 0
#endif

#ifndef BTA_AV_SINK_INCLUDED
#define BTA_AV_SINK_INCLUDED 0
#endif

#ifndef BTA_JV_INCLUDED
#define BTA_JV_INCLUDED 0
#endif

#ifndef BTA_SDP_INCLUDED
#define BTA_SDP_INCLUDED 0
#endif

/* This is set to enable use of GAP L2CAP connections. */
#ifndef VND_BT_JV_BTA_L2CAP
#define VND_BT_JV_BTA_L2CAP        0
#endif

#ifndef BTA_JV_L2CAP_INCLUDED
#define BTA_JV_L2CAP_INCLUDED       0
#endif

#ifndef GAP_CONN_INCLUDED
#define GAP_CONN_INCLUDED           0
#endif

/******************************************************************************
**
** Stack-layer components
**
******************************************************************************/
#ifndef AVCT_INCLUDED
#define AVCT_INCLUDED 0
#endif

#ifndef AVDT_INCLUDED
#define AVDT_INCLUDED 0
#endif

/******************************************************************************
**
** Parameter Configurations for components
**
******************************************************************************/
#ifndef BTA_DISABLE_DELAY
#define BTA_DISABLE_DELAY 200 /* in milliseconds */
#endif

#ifndef BTA_SYS_TIMER_PERIOD
#define BTA_SYS_TIMER_PERIOD  100
#endif

#ifndef SBC_FOR_EMBEDDED_LINUX
#define SBC_FOR_EMBEDDED_LINUX 1
#endif

#ifndef AVDT_VERSION
#define AVDT_VERSION  0x0102
#endif

#ifndef BTA_AG_AT_MAX_LEN
#define BTA_AG_AT_MAX_LEN  512
#endif

#ifndef BTA_AVRCP_FF_RW_SUPPORT
#define BTA_AVRCP_FF_RW_SUPPORT 0
#endif

#ifndef BTA_AG_SCO_PKT_TYPES
#define BTA_AG_SCO_PKT_TYPES  (BTM_SCO_LINK_ONLY_MASK | BTM_SCO_PKT_TYPES_MASK_EV3 |  BTM_SCO_PKT_TYPES_MASK_NO_3_EV3 | BTM_SCO_PKT_TYPES_MASK_NO_2_EV5 | BTM_SCO_PKT_TYPES_MASK_NO_3_EV5)
#endif

#ifndef BTA_AV_RET_TOUT
#define BTA_AV_RET_TOUT 15
#endif

#ifndef PORCHE_PAIRING_CONFLICT
#define PORCHE_PAIRING_CONFLICT  1
#endif

#ifndef BTA_AV_CO_CP_SCMS_T
#define BTA_AV_CO_CP_SCMS_T  0
#endif

#if UC_BT_BLE_HOST_QUEUE_CONGESTION_CHECK
#define SCAN_QUEUE_CONGEST_CHECK  1
#else
#define SCAN_QUEUE_CONGEST_CHECK  0
#endif

#ifdef UC_CONFIG_BT_GATTS_PPCP_CHAR_GAP
#define BTM_PERIPHERAL_ENABLED   UC_CONFIG_BT_GATTS_PPCP_CHAR_GAP
#endif

#ifdef UC_BT_GATTS_SEND_SERVICE_CHANGE_MODE
#define GATTS_SEND_SERVICE_CHANGE_MODE UC_BT_GATTS_SEND_SERVICE_CHANGE_MODE
#endif

#ifdef UC_BT_BLE_ACT_SCAN_REP_ADV_SCAN
#define BTM_BLE_ACTIVE_SCAN_REPORT_ADV_SCAN_RSP_INDIVIDUALLY    UC_BT_BLE_ACT_SCAN_REP_ADV_SCAN
#endif

/* This feature is used to eanble interleaved scan*/
#ifndef BTA_HOST_INTERLEAVE_SEARCH
#define BTA_HOST_INTERLEAVE_SEARCH 0
#endif

#ifndef BT_USE_TRACES
#define BT_USE_TRACES  0
#endif

